<form method="get">
	<input type="text" name="number">
	<input type="submit">
</form>
<?php
	/*
	  Необходимо вывести на экран строку с количеством товаров следующего вида: "N товаров", где N - количество товаров. Нужно написать функцию, которая будет формировать строку с выводом в правильном склонении в зависимости от числа.
	*/

	if( isset($_GET['number']) ){
		$numberUser = trim($_GET['number']);
		echo "Результат: ";
		getNumber( $numberUser );
	}

	function getNumber($num = 0){
		if (!is_numeric($num)){
			echo "Введите число";
		} else{
			if($num <= 0){
				echo "Товаров нет";
			} elseif ( $num == 1 ||  $num == 21 || $num == 31 || $num == 41 || $num == 51 || $num == 61 || $num == 71 || $num == 81) {
				echo "$num товар";
			} elseif ( $num == 2 ||  $num == 3 || $num == 4 || $num == 22 || $num == 23 || $num == 24 || $num == 32 || $num == 33 || $num == 34) {
				echo "$num товара";
			} else {
				echo "$num товаров";
			}			
		}
	}


?>

<hr>

товар 1,21,31,41,51

товара 2,3,4, 22,23,24, 32,33,34, 42,43,44, 52,53,54, 

товаров 5,6,7,8,9,10, 11,12,13,14,15,16,17,18,19,20, 25,26,27,28,29,30, 35,36,37,38,39,40, 45,46,47,48,49,50, 55,56,57,58,59,60 
